vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32h503/USART_reginfo.h
/* This file is generated by stm32_reggen.py from stm32h503xx.h
 * Do not edit this file manually!
 * If corrections are needed, use the
 * override mechanism(s) defined to modify the parsed results
 * and re-run the script to update the file.
 *
 * This file contains the USART register metadata for the stm32h503 series of chips.
 */

#pragma once
#include "../../stm32_gen_common.h"
static const stm32_reginfo_t stm32_h503_usart_reginfo[RI_END] =
{
	[RI_CR1            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_CR2            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFF79 }, /* mask = 0b11111111111111111111111101111001 */
	[RI_CR3            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFEFFFF }, /* mask = 0b11111111111111101111111111111111 */
	[RI_BRR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_GTPR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_RTOR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_RQR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000001F }, /* mask = 0b00000000000000000000000000011111 */
	[RI_ISR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0FFFFFFF }, /* mask = 0b00001111111111111111111111111111 */
	[RI_ICR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00123BFF }, /* mask = 0b00000000000100100011101111111111 */
	[RI_RDR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000001FF }, /* mask = 0b00000000000000000000000111111111 */
	[RI_TDR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000001FF }, /* mask = 0b00000000000000000000000111111111 */
	[RI_PRESC          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000000F }, /* mask = 0b00000000000000000000000000001111 */
};

